In [1]:
import pandas as pd

## Series

In [5]:
states = pd.Series(['Madhya Pradesh', 'Kartnataka', 'Maharashtra', 'Uttar Pradesh'])

In [6]:
states

0    Madhya Pradesh
1        Kartnataka
2       Maharashtra
3     Uttar Pradesh
dtype: object

In [7]:
for state in states:
    print(state)

Madhya Pradesh
Kartnataka
Maharashtra
Uttar Pradesh

In [8]:
states[2]

'Maharashtra'

## Dataframe

In [11]:
cities = pd.DataFrame([
        ['New Delhi', 'New Delhi', 'India'],
        ['Bhopal', 'MP', 'India'],
        ['Minneapolis', 'Minnesota', 'US'],
        ['Tokyo', 'Tokyo', 'Japan']
    ],
    columns=['City', 'State', 'Country']
)

In [12]:
cities

          City      State Country
0    New Delhi  New Delhi   India
1       Bhopal         MP   India
2  Minneapolis  Minnesota      US
3        Tokyo      Tokyo   Japan

In [13]:
cities.head(2)

        City      State Country
0  New Delhi  New Delhi   India
1     Bhopal         MP   India

In [14]:
cities.tail(2)

          City      State Country
2  Minneapolis  Minnesota      US
3        Tokyo      Tokyo   Japan

In [15]:
cities.shape

(4, 3)

In [16]:
cities.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   City     4 non-null      object
 1   State    4 non-null      object
 2   Country  4 non-null      object
dtypes: object(3)
memory usage: 224.0+ bytes